In [1]:
import pandas as pd
from sqlalchemy import create_engine, text

In [2]:
from sqlalchemy import create_engine
engine = create_engine("postgresql://root:root@localhost:5432/umkm")

### Create table

In [26]:
with engine.connect() as conn:
    # Drop existing if any
    conn.execute(text("DROP TABLE IF EXISTS purchase_items CASCADE"))
    conn.execute(text("DROP TABLE IF EXISTS purchases CASCADE"))
    conn.execute(text("DROP TABLE IF EXISTS sales_items CASCADE"))
    conn.execute(text("DROP TABLE IF EXISTS sales CASCADE"))
    conn.execute(text("DROP TABLE IF EXISTS products CASCADE"))
    conn.execute(text("DROP TABLE IF EXISTS umkm CASCADE"))
    conn.execute(text("DROP TABLE IF EXISTS suppliers CASCADE"))

    # UMKM Table
    conn.execute(text("""
    CREATE TABLE umkm (
        umkm_id SERIAL PRIMARY KEY,
        name TEXT NOT NULL,
        owner TEXT,
        address TEXT
    );
    """))

    # Product Table (per UMKM)
    conn.execute(text("""
    CREATE TABLE products (
        product_id SERIAL PRIMARY KEY,
        umkm_id INTEGER NOT NULL REFERENCES umkm(umkm_id),
        name TEXT NOT NULL,
        category TEXT,
        price NUMERIC(12,2) NOT NULL CHECK (price >= 0),
        stock INTEGER DEFAULT 0 CHECK (stock >= 0),
        is_active BOOLEAN DEFAULT TRUE
    );
    """))

    # Supplier Table
    conn.execute(text("""
    CREATE TABLE suppliers (
        supplier_id SERIAL PRIMARY KEY,
        name TEXT NOT NULL,
        contact TEXT
    );
    """))

    # Sales Table
    conn.execute(text("""
    CREATE TABLE sales (
        sale_id SERIAL PRIMARY KEY,
        umkm_id INTEGER NOT NULL REFERENCES umkm(umkm_id),
        customer_name TEXT,
        sale_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
        total_amount NUMERIC(12,2) CHECK (total_amount >= 0),
        status TEXT NOT NULL DEFAULT 'diproses' CHECK (status IN ('selesai', 'diproses', 'dibatalkan')),
        transcript TEXT
    );
    """))

    # Sales Items
    conn.execute(text("""
    CREATE TABLE sales_items (
        id SERIAL PRIMARY KEY,
        sale_id INTEGER NOT NULL REFERENCES sales(sale_id) ON DELETE CASCADE,
        product_id INTEGER NOT NULL REFERENCES products(product_id),
        quantity INTEGER NOT NULL CHECK (quantity > 0),
        unit_price NUMERIC(12,2) NOT NULL CHECK (unit_price >= 0)
    );
    """))

    # Purchases Table
    conn.execute(text("""
    CREATE TABLE purchases (
        purchase_id SERIAL PRIMARY KEY,
        umkm_id INTEGER NOT NULL REFERENCES umkm(umkm_id),
        supplier_id INTEGER REFERENCES suppliers(supplier_id),
        purchase_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
        total_amount NUMERIC(12,2) CHECK (total_amount >= 0),
        transcript TEXT
    );
    """))

    # Purchase Items
    conn.execute(text("""
    CREATE TABLE purchase_items (
        id SERIAL PRIMARY KEY,
        purchase_id INTEGER NOT NULL REFERENCES purchases(purchase_id) ON DELETE CASCADE,
        product_id INTEGER NOT NULL REFERENCES products(product_id),
        quantity INTEGER NOT NULL CHECK (quantity > 0),
        unit_price NUMERIC(12,2) NOT NULL CHECK (unit_price >= 0)
    );
    """))

    conn.commit()
    print("✅ Semua tabel berhasil dibuat!")

✅ Semua tabel berhasil dibuat!

In [27]:
with engine.connect() as conn:
    # Seed UMKM
    conn.execute(text("""
    INSERT INTO umkm (name, owner, address)
    VALUES 
        ('Warung Bu Siti', 'Siti Aminah', 'Jl. Melati No. 12'),
        ('Kantin Pak Budi', 'Budi Santoso', 'Jl. Kenanga No. 7');
    """))

    # Seed Products
    conn.execute(text("""
    INSERT INTO products (umkm_id, name, category, price, stock)
    VALUES 
        (1, 'Bakso', 'Makanan', 15000, 50),
        (1, 'Es Teh', 'Minuman', 5000, 100),
        (1, 'Nasi Goreng', 'Makanan', 20000, 30),
        (2, 'Mie Ayam', 'Makanan', 17000, 40),
        (2, 'Es Jeruk', 'Minuman', 6000, 70);
    """))

    # Seed Suppliers
    conn.execute(text("""
    INSERT INTO suppliers (name, contact)
    VALUES 
        ('Toko Sumber Rejeki', '08123456789'),
        ('Grosir Minuman Segar', '082233445566');
    """))

    # Seed Sales
    conn.execute(text("""
    INSERT INTO sales (sale_id, umkm_id, customer_name, total_amount, transcript, status)
    VALUES 
        (1, 1, 'Ibu Rina', 35000, 'Beli 2 bakso dan 1 es teh', 'selesai'),
        (2, 2, 'Pak Dedi', 23000, 'Mie ayam dan es jeruk', 'selesai');
    """))



    # Seed Sales Items
    conn.execute(text("""
    INSERT INTO sales_items ( product_id, quantity, unit_price)
    VALUES 
        -- Transaksi 1: Ibu Rina
        (1, 1, 2, 15000),  -- 2 x Bakso @15.000 = 30.000
        (1, 2, 1, 5000),   -- 1 x Es Teh @5.000 = 5.000
    
        -- Transaksi 2: Pak Dedi
        (2, 4, 1, 17000),  -- 1 x Mie Ayam @17.000 = 17.000
        (2, 5, 1, 6000);   -- 1 x Es Jeruk @6.000 = 6.000
    """))

    # Seed Purchases
    conn.execute(text("""
    INSERT INTO purchases (umkm_id, supplier_id, total_amount, transcript)
    VALUES 
        (1, 1, 100000, 'Pembelian bahan bakso'),
        (2, 2, 80000, 'Beli stok es jeruk dan es batu');
    """))

    # Seed Purchase Items
    conn.execute(text("""
    INSERT INTO purchase_items (purchase_id, product_id, quantity, unit_price)
    VALUES 
        (1, 1, 10, 10000),  -- Bakso
        (2, 5, 20, 4000);   -- Es Jeruk
    """))

    conn.commit()
    print("✅ Semua seed data berhasil dimasukkan!")

✅ Semua seed data berhasil dimasukkan!

In [12]:
df = pd.read_sql("SELECT * FROM SALES a LEFT JOIN sales_items b on a.sale_id=b.sale_id WHERE umkm_id = 1 order by sale_date limit 1", engine)
df.head()

,sale_id,umkm_id,customer_name,sale_date,total_amount,status,transcript,id,sale_id,product_id,quantity,unit_price
0,1,1,Ibu Rina,2025-07-25 04:33:29.612804,35000.0,selesai,Beli bakso dan es teh,1,1,1,2,15000.0

In [28]:
df = pd.read_sql("""
SELECT 
    s.sale_id, s.sale_date, s.status, s.total_amount,
    p.product_id, p.name as product_name, p.category,
    si.quantity, si.unit_price
FROM sales s
LEFT JOIN sales_items si ON s.sale_id = si.sale_id
LEFT JOIN products p ON si.product_id = p.product_id
WHERE s.umkm_id = '1'
ORDER BY s.sale_date DESC, s.sale_id DESC

LIMIT 5 -- ambil lebih banyak untuk menghindari kehilangan item jika ada >1 per transaksi


""", engine)
df.head()

,sale_id,sale_date,status,total_amount,product_id,product_name,category,quantity,unit_price
0,1,2025-07-25 04:57:21.879399,selesai,35000.0,1,Bakso,Makanan,2,15000.0
1,1,2025-07-25 04:57:21.879399,selesai,35000.0,2,Es Teh,Minuman,1,5000.0

In [5]:
!curl -X POST http://localhost:8000/transactions/from-llm \
  -H "Content-Type: application/json" \
  -d '{"umkm_id": 1, "transaction_type": "sale", "notes": "LLM: Saya beli 5 bakso dan 2 es teh", "items": [{"product_id": 1, "name": "bakso", "quantity": 5, "unit_price": 15000}, {"product_id": 2, "name": "es teh", "quantity": 2, "unit_price": 5000}]}'

{"message":"Sale transaction created","sale_id":4}

In [4]:
df = pd.read_sql("SELECT * FROM SALES", engine)
df.head()

,sale_id,umkm_id,customer_name,sale_date,total_amount,notes
0,1,1,Ibu Rina,2025-06-20 15:25:21.129543,35000.0,Beli bakso dan es teh
1,2,2,Pak Dedi,2025-06-20 15:25:21.129543,23000.0,Mie ayam dan es jeruk
2,3,1,Auto (LLM),2025-06-20 16:05:24.923941,85000.0,LLM: Saya beli 5 bakso dan 2 es teh

### LLM Response Test

In [6]:
# test prepare transcript
!curl -X POST http://localhost:8000/api/v1/transactions/generate-draft \
-H "Content-Type: application/json" \
-d '{"umkm_id": 1,"transcript": "saya beli 2 es teh dan 3 bakso"}'

{"detail":"Not Found"}

In [3]:
!curl -X GET http://34.50.99.124:8000/report/monthly_transaction \
  -H "Content-Type: application/json" \
  -d '{"umkm_id": 1, "year":2025, "month":6}'

^C